In [102]:
import pandas as pd
print(pd.__version__)
print("Created by Guru Sarath Thangamani")

1.0.5
Created by Guru Sarath Thangamani

## Loading Data into a dataframe

In [76]:
ExcelData = pd.read_excel('dataTest.xlsx')
ExcelData

         Col1  Col2  Col3         ColX        ColY   ColZ
0   71.498436     7   36.0  352.255882  732.553714   BIKE
1   17.956901    10   68.0  115.345990  332.931977    CAR
2   14.929322     6   32.0  174.437312  220.937104  CYCLE
3   45.702541     4   34.0  124.597932   38.977847  CYCLE
4   96.676599     2    6.0   12.586074  149.704278    NaN
5   38.666686     4   74.0    5.328834  713.282264  CYCLE
6    3.878606     4   40.0   82.931257   67.779861  CYCLE
7   78.793465     9    2.0  156.132930  113.694820  CYCLE
8   18.187895     9    8.0  884.925352  267.292954   BIKE
9   64.662811     2   57.0  322.193543  114.734475   BIKE
10  48.105475     9   33.0  232.410644  565.303631   BIKE
11  48.347856     3   35.0  140.705772  156.567207   BIKE
12  90.857124     3    NaN  673.799210  114.324660  CYCLE
13  45.607160     1    NaN   17.900406  116.687005    CAR
14  23.889049     3    NaN  607.793399    3.078456  CYCLE
15  40.423044     7    NaN         NaN  105.027885  CYCLE
16  20.159351     4   25.0  487.824454  148.684656    CAR
17  36.747679     0    3.0   20.377178   21.589040    JET
18  59.367416     6   99.0  471.019195  200.975318    CAR
19  16.875504     2   90.0  143.937241  182.765071    JET
20  51.196401     2   16.0  131.825812  497.949865    JET
21  12.022286     3   60.0    9.150044   45.938443    JET
22  95.304490     8   13.0  417.465791    9.907030   BIKE
23  50.814068     8   83.0         NaN   93.040035    NaN
24  28.990477     2   43.0         NaN  244.219894   BIKE
25   7.457016     9   46.0  168.557753  692.884394    JET
26  56.685440    10   68.0  128.027951  300.529520    CAR
27  66.862467     3  100.0  628.117833  373.297118    CAR
28  40.494010     7   34.0    3.226088   68.118384    CAR

## Check datatype of a column

In [49]:
print(ExcelData['Col1'].dtype)
print(ExcelData['Col2'].dtype)
print(ExcelData['ColZ'].dtype)

float64
int64
object

## Head and Tail

In [65]:
ExcelData.head(3) #First 3 data

        Col1  Col2  Col3         ColX        ColY   ColZ
0  71.498436     7   36.0  352.255882  732.553714   BIKE
1  17.956901    10   68.0  115.345990  332.931977    CAR
2  14.929322     6   32.0  174.437312  220.937104  CYCLE

In [66]:
ExcelData.tail(3) #Last 3 data

         Col1  Col2  Col3         ColX        ColY ColZ
26  56.685440    10   68.0  128.027951  300.529520  CAR
27  66.862467     3  100.0  628.117833  373.297118  CAR
28  40.494010     7   34.0    3.226088   68.118384  CAR

## Slicing

In [44]:
ExcelData[['Col1','ColZ']].head()

        Col1   ColZ
0  71.498436   BIKE
1  17.956901    CAR
2  14.929322  CYCLE
3  45.702541  CYCLE
4  96.676599    NaN

## Slicing: loc - [row range , list of column names]

In [69]:
ExcelData.loc[3:5, 'Col1']

3    45.702541
4    96.676599
5    38.666686
Name: Col1, dtype: float64

In [70]:
ExcelData.loc[5:10, ['Col1','ColZ']]

         Col1   ColZ
5   38.666686  CYCLE
6    3.878606  CYCLE
7   78.793465  CYCLE
8   18.187895   BIKE
9   64.662811   BIKE
10  48.105475   BIKE

## Slicing: iloc [row range , column range]

In [93]:
ExcelData.iloc[5]

Col1     38.6667
Col2           4
Col3          74
ColX     5.32883
ColY     713.282
ColZ       CYCLE
Name: 5, dtype: object

In [75]:
ExcelData.iloc[5:10, 2:6]

   Col3         ColX        ColY   ColZ
5   74.0    5.328834  713.282264  CYCLE
6   40.0   82.931257   67.779861  CYCLE
7    2.0  156.132930  113.694820  CYCLE
8    8.0  884.925352  267.292954   BIKE
9   57.0  322.193543  114.734475   BIKE

## Delete columns

In [97]:
ExcelData.drop(columns = ['Col2','ColX','ColY','ColZ']).head()

        Col1  Col3
0  71.498436   36.0
1  17.956901   68.0
2  14.929322   32.0
3  45.702541   34.0
4  96.676599    6.0

In [100]:
HeadData = ExcelData.head()
HeadData.drop(['Col2','ColX','ColY','ColZ'], axis=1)

        Col1  Col3
0  71.498436   36.0
1  17.956901   68.0
2  14.929322   32.0
3  45.702541   34.0
4  96.676599    6.0

## Delete rows

In [98]:
HeadData = ExcelData.head()
HeadData.drop([1,2,3], axis=0)

        Col1  Col2  Col3         ColX        ColY  ColZ
0  71.498436     7   36.0  352.255882  732.553714  BIKE
4  96.676599     2    6.0   12.586074  149.704278   NaN

## Converting to numpy array

In [86]:
type(ExcelData.values)

numpy.ndarray

## Summary of the table

In [13]:
ExcelData.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29 entries, 0 to 28
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Col1    29 non-null     float64
 1   Col2    29 non-null     int64
 2   Col3    25 non-null     float64
 3   ColX    26 non-null     float64
 4   ColY    29 non-null     float64
 5   ColZ    27 non-null     object
dtypes: float64(4), int64(1), object(1)
memory usage: 1.5+ KB

In [38]:
ExcelData['ColZ'].value_counts()

CYCLE    8
BIKE     7
CAR      7
JET      5
Name: ColZ, dtype: int64

In [15]:
print('size = ', ExcelData.size)
print('shape = ', ExcelData.shape)

size =  174
shape =  (29, 6)

## Pandas Dataframe vs Series

In [25]:
Col1 = ExcelData['Col1'] # This is a pandas series
print(type(Col1))

Col1 = ExcelData[['Col1']] # This is a pandas Dataframe
print(type(Col1))

<class 'pandas.core.series.Series'>
<class 'pandas.core.frame.DataFrame'>

# Filters

In [58]:
ColZ_equals_CAR = ExcelData['ColZ'] == 'CAR' #Create a filter
print(ColZ_equals_CAR.head())

0    False
1     True
2    False
3    False
4    False
Name: ColZ, dtype: bool

In [60]:
ExcelData[ColZ_equals_CAR]

         Col1  Col2  Col3         ColX        ColY ColZ
1   17.956901    10   68.0  115.345990  332.931977  CAR
13  45.607160     1    NaN   17.900406  116.687005  CAR
16  20.159351     4   25.0  487.824454  148.684656  CAR
18  59.367416     6   99.0  471.019195  200.975318  CAR
26  56.685440    10   68.0  128.027951  300.529520  CAR
27  66.862467     3  100.0  628.117833  373.297118  CAR
28  40.494010     7   34.0    3.226088   68.118384  CAR

In [61]:
ExcelData.loc[Col1_greater_than_30, ['Col1','Col2','ColZ']]

         Col1  Col2 ColZ
1   17.956901    10  CAR
13  45.607160     1  CAR
16  20.159351     4  CAR
18  59.367416     6  CAR
26  56.685440    10  CAR
27  66.862467     3  CAR
28  40.494010     7  CAR

### Using multiple filters

In [62]:
col2_greaterthan_4 = ExcelData['Col2'] > 4

In [63]:
ExcelData.loc[Col1_greater_than_30 & col2_greaterthan_4, ['Col1','Col2','ColZ']]

         Col1  Col2 ColZ
1   17.956901    10  CAR
18  59.367416     6  CAR
26  56.685440    10  CAR
28  40.494010     7  CAR

## Analysis

### Get the rows with missing values

In [81]:
missing_data_filter = ExcelData.isna()
missing_data_filter.head()

    Col1   Col2  Col3    ColX   ColY   ColZ
0  False  False  False  False  False  False
1  False  False  False  False  False  False
2  False  False  False  False  False  False
3  False  False  False  False  False  False
4  False  False  False  False  False   True

In [82]:
missing_data_filter = missing_data_filter.any(axis = 1)
missing_data_filter.head()

0    False
1    False
2    False
3    False
4     True
dtype: bool

In [88]:
print('Data points with NaN')
DataPointsWithNaN = ExcelData[missing_data_filter]
DataPointsWithNaN

Data points with NaN

         Col1  Col2  Col3         ColX        ColY   ColZ
4   96.676599     2    6.0   12.586074  149.704278    NaN
12  90.857124     3    NaN  673.799210  114.324660  CYCLE
13  45.607160     1    NaN   17.900406  116.687005    CAR
14  23.889049     3    NaN  607.793399    3.078456  CYCLE
15  40.423044     7    NaN         NaN  105.027885  CYCLE
23  50.814068     8   83.0         NaN   93.040035    NaN
24  28.990477     2   43.0         NaN  244.219894   BIKE

## Filling missing data

In [90]:
DataPointsWithNaN.fillna(999999) #Fill missing data with a fixed value

         Col1  Col2     Col3            ColX        ColY    ColZ
4   96.676599     2       6.0      12.586074  149.704278  999999
12  90.857124     3  999999.0     673.799210  114.324660   CYCLE
13  45.607160     1  999999.0      17.900406  116.687005     CAR
14  23.889049     3  999999.0     607.793399    3.078456   CYCLE
15  40.423044     7  999999.0  999999.000000  105.027885   CYCLE
23  50.814068     8      83.0  999999.000000   93.040035  999999
24  28.990477     2      43.0  999999.000000  244.219894    BIKE

In [92]:
DataPointsWithNaN.fillna(method='ffill')  # Methods = {backfill, bfill, pad, ffill, None}, default None

         Col1  Col2  Col3         ColX        ColY   ColZ
4   96.676599     2    6.0   12.586074  149.704278    NaN
12  90.857124     3    6.0  673.799210  114.324660  CYCLE
13  45.607160     1    6.0   17.900406  116.687005    CAR
14  23.889049     3    6.0  607.793399    3.078456  CYCLE
15  40.423044     7    6.0  607.793399  105.027885  CYCLE
23  50.814068     8   83.0  607.793399   93.040035  CYCLE
24  28.990477     2   43.0  607.793399  244.219894   BIKE